# НАЧАЛО
# ПОКА нашлось (12) ИЛИ нашлось (322) ИЛИ нашлось (222)
#  ЕСЛИ нашлось (12)
#    ТО заменить (12, 2)
#  КОНЕЦ ЕСЛИ
# ЕСЛИ нашлось (322)
#    ТО заменить (322, 21)
#  КОНЕЦ ЕСЛИ
#  ЕСЛИ нашлось (222)
#    ТО заменить (222, 3)
#  КОНЕЦ ЕСЛИ
# КОНЕЦ ПОКА
# КОНЕЦ
h = []


def F(n):
    while '12' in n or '322' in n or '222' in n:
        if '12' in n:
            n = n.replace('12', '2', 1)
        if '322' in n:
            n = n.replace('322', '21', 1)
        if '222' in n:
            n = n.replace('222', '3', 1)
    return n


for i in range(3, 10001):
    n = '1' + '2' * i
    h.append(sum(list(map(int, F(n)))))
print(max(h))