# НАЧАЛО
# ПОКА нашлось (72) ИЛИ нашлось (522) ИЛИ нашлось (2222)
#  ЕСЛИ нашлось (72)
#    ТО заменить (72, 2)
#  КОНЕЦ ЕСЛИ
#  ЕСЛИ нашлось (522)
#   ТО заменить (522, 27)
#  КОНЕЦ ЕСЛИ
#  ЕСЛИ нашлось (2222)
#   ТО заменить (2222, 5)
#  КОНЕЦ ЕСЛИ
# КОНЕЦ ПОКА
#
h = []


def F(n):
    while '72' in n or '522' in n or '2222' in n:
        if '72' in n:
            n = n.replace('72', '2', 1)
        if '522' in n:
            n = n.replace('522', '27', 1)
        if '2222' in n:
            n = n.replace('2222', '5', 1)
    return n


for i in range(3, 10000):
    n = '5' + '2' * i
    if sum(list(map(int, F(n)))) == 63:
        h.append(i)
print(min(h))
