
for x in range(14,24):
    if not(x in range(5,31) == (x in range(14,24))) or (x not in []):
        print('Задание 15 На числовой прямой даны два отрезка: P=[5,30] и Q=[14,23]. Укажите наибольшую возможную длину такого отрезка A, что формул ((x ∈ P) ≡ (x ∈ Q)) → (x ∉ A) тождественно истинна, то есть принимает значение 1 при любом значении переменной х.')

